[
  {
    "definition": "Longevity medicine is advanced personalised preventive medicine powered by deep biomarkers of aging and longevity, and is a fast-emerging field. The field encompasses the likewise rapidly evolving areas of biogerontology, geroscience, and precision, preventive, and functional medicine. With modern advances in artificial intelligence and machine learning, biomarker research and drug development have produced numerous tools for early diagnostics and prevention of communicable and non-communicable diseases, which remain largely unknown to the global medical community. This unawareness is mainly due to a complete absence of structured, pedagogically-concepted educational resources tailored to specific audiences, primarily consisting of physicians, biotechnologists, and public health professionals. The notion of longevity and healthy aging as a major priority for healthcare will undoubtedly substantially impact primary, secondary, and tertiary prevention. Therefore, it is essential that practicing doctors have access to the appropriate education through a credible curriculum in longevity medicine. The development of longevity-focused medical practices greatly depends on bridging the gap between health-care providers and interdisciplinary experts, such as academic biogerontologists, artificial intelligence experts, computer scientists, and informaticians. Health-care providers require customised courses on the most recent advances in longevity medicine and on how this knowledge can be implemented in the practice. Patients have insufficient access to the health-care providers who have been adequately trained in longevity medicine and can manage a patient from a longevity medicine standpoint. Viable longevity education with practical translation will thus ultimately improve health-care systems worldwide and decrease disease occurrence by training health-care providers to tackle the most common and strongest contributor of disease—unhealthy aging. Longevity medicine combines best practices from various fields and uses leading-edge innovations, such as deep learning and artificial intelligence to evaluate the patient's biological age throughout the course of life. Longevity physicians are looking for ways to reduce the gap between the current parameters (current biological age) and the parameters of optimal maximum physical performance (the ideal biological age, predicted by deep learning). Aging is a complex multifactorial process leading to loss of function, rendering people prone to most diseases. Many genetic and epigenetic changes implicated in aging and longevity are associated with aging in model organisms. Even though their mechanisms in human aging are not fully understood, many of these changes are also associated with non-communicable, mostly chronic diseases in humans. The unprecedented increase in the proportion of people over 65 years across the global population and the increase in illness, and social and economic burden associated with aging require educated physicians who are knowledgeable about the multifaceted healthy longevity approaches, commencing with fundamentals of biogerontology and artificial intelligence-based technologies that are applicable in individualised patient care. Adequate curricula on aging and longevity biotechnology encompassing and explaining the complexities of those fields are an essential foundation to differentiate the burgeoning longevity medicine from anti-aging and prolonging life. Equipping health-care providers with tools of obtaining and utilising an individualised precision dataset of each patient not only reduces the risks of the patient developing diseases, but mitigates and even eliminate diseases, and customises optimal preventive and therapeutic approaches.",
    "tag": "longevity"
  },
  {
    "definition": "Researchers from Harvard University looked at factors that might increase the chances of a longer life. [2] Using data collected from men and women from the Nurses’ Health Study and Health Professionals Follow-up Study who were followed for up to 34 years, researchers identified five low-risk lifestyle factors: healthy diet, regular exercise (at least 30 minutes daily of moderate to vigorous activity), healthy weight (as defined by a body mass index of 18.5-24.9), no smoking, and moderate alcohol intake (up to 1 drink daily for women, and up to 2 daily for men). Compared with those who did not incorporate any of these lifestyle factors, those with all five factors lived up to 14 years longer. In a follow-up study, the researchers found that those factors might contribute to not just a longer but also a healthier life. [2] They saw that women at age 50 who practiced four or five of the healthy habits listed above lived about 34 more years free of diabetes, cardiovascular diseases, and cancer, compared with 24 more disease-free years in women who practiced none of these healthy habits. Men practicing four or five healthy habits at age 50 lived about 31 years free of chronic disease, compared with 24 years among men who practiced none. Men who were current heavy smokers, and men and women with obesity, had the lowest disease-free life expectancy.",
    "tag": "longevity"
  },
  {
    "definition": "Let's begin by defining exactly what cognitive performance means. Essentially, it refers to our cognitive abilities or mental processes. This includes things like our attention span, memory, reaction time, problem-solving ability, and more. Cognitive performance is a measure ofhow well our brain functions. And when we talk about high cognitive performance, we're talking about peak brain function - functioning at our very best. As you might guess, many benefits come with having high cognitive performance. Here are a few examples of how it can benefit us: 1) Studies have showncognitive performance is linked with job success - those with higher cognitive scores are more likely to be successful in their careers. 2) Cognitive performance is also linked with earnings potential - those with higher cognitive scores tend to earn more money 3) Better cognitive performance has beenlinked with healthier lifestyle choices, such as eating a healthy diet and getting regular exercise 4) People with high cognitive scores are alsoless likely to develop dementia and other age-related diseases",
    "tag": "cognitive performance"
  },
  {
    "definition": "High cognitive performance or “peak brain performance“ refers to the achievement of optimal and effective functioning of cognitive capabilities and executive functions. Work concentrates on the capabilities that are preserved from any alterations, aiming at achieving optimal performance for each person. People who wish to perfect and further refine the results obtained at cognitive level improve, for example, memory, processing speed, and decision-making. These capabilities are boosted to optimal levels, better adjusting to the high demands of the current labor market. It is well-known that in some professional contexts, such as top-class sports, training of athletes extends further than the improvement of physical conditions only, and that is where cognitive performance appears as an important factor for success. But, how can this aspect be trained by an athlete? There are currently several ways of exercising mental capabilities from a cognitive psychology aspect, and cognitive stimulation has been in the spotlight recently.",
    "tag": "cognitive performance"
  },
  {
    "definition": "Muscle growth involves increasing muscular size, typically through strength training and protein supplementation [1]. Dietary protein intake supports skeletal muscle remodeling after exercise by stimulating muscle protein synthesis and can optimize resistance training-mediated increases in skeletal muscle size and strength [1]. Muscle growth has been an important issue in the sports field for decades. Numerous researchers have focused on how to improve sports performance for athletics [2]. In recent years, muscle growth has also become a popular issue in clinical medicine. Sarcopenia is increasingly linked to aging and is associated with an increased likelihood of adverse outcomes, including falls, fractures, frailty, and mortality [3]. Therefore, finding ways to increase muscle strength and physical performance to prevent falling down, or even fractures, in the older population is one of the most important issues in geriatrics. Numerous supplements for muscle growth have been discovered or developed since the 1980s, such as whey protein, casein, beta-hydroxy beta-methyl butyrate, omega-3 fatty acids, and creatine [5,6,7,8]. Creatine, an ergogenic compound, is an important intermediate in the metabolism of muscles, brain, and other tissues with high energy demand and fluxes [9]. It is endogenously formed from the amino acids arginine, glycine, and methionine in the kidneys and liver [10]. Exogenously, creatine is primarily consumed via meat and/or as a dietary supplement.",
    "tag": "muscle growth"
  },
  {
    "definition": "Nutrition is crucial to gaining and maintaining healthy muscle mass. The right nutrients not only fuel your workouts, but also support your body’s ability to grow and repair muscle tissue.“Your muscle tissue can only grow if it has the appropriate building blocks,” says Nicholas Anastasio, M.D., a board-certified physician specializing in physical medicine and rehabilitation at Orthopedics and Joint Replacement at Mercy in Baltimore. “A healthy diet consisting of a broad range of nutrients and appropriate calories can sustain the needs for muscle tissue growth. Supplementation with certain nutrients can also help ensure your body has the right fuel it needs,” he says.While specific nutritional needs vary from person to person, there are several supplements research suggests can help promote muscle growth and performance. Below are five science-backed, expert-recommended supplements worth considering if your fitness goals prioritize building muscle.Why protein powder is one of the most popular types of protein powder and comes highly recommended by nutrition experts for muscle growth. It’s a complete protein—meaning it contains all nine essential amino acids—and many consumers find it to be easily digestible, making it an ideal source of fuel for muscle growth, says Dr. Anastasio. Research supports the use of whey protein to stimulate muscle protein synthesis and reduce muscle protein breakdown, ultimately resulting in a positive increase in muscle mass when consumed in adequate amounts. “The recommendation is to consume 0.36 grams of protein per pound of body weight per day. However, if you’re strength training regularly, up to 0.45 grams per pound of body weight per day is recommended,” he says. Adding a scoop of whey protein powder to your smoothies or shakes can help you meet your body’s daily protein needs for muscle growth.",
    "tag": "muscle growth"
  },
  {
    "definition": "Sometimes, the pace of modern life barely gives you time to stop and rest. It can make getting a good night’s sleep on a regular basis seem like a dream. But sleep is as important for good health as diet and exercise. Good sleep improves your brain performance, mood, and health.Not getting enough quality sleep regularly raises the risk of many diseases and disorders. These range from heart disease and stroke to obesity and dementia. There’s more to good sleep than just the hours spent in bed, says Dr. Marishka Brown, a sleep expert at NIH. “Healthy sleep encompasses three major things,” she explains. “One is how much sleep you get. Another is sleep quality—that you get uninterrupted and refreshing sleep. The last is a consistent sleep schedule.” People who work the night shift or irregular schedules may find getting quality sleep extra challenging. And times of great stress—like the current pandemic—can disrupt our normal sleep routines. But there are many things you can do to improve your sleep. Why do we need to sleep? People often think that sleep is just “down time,” when a tired brain gets to rest, says Dr. Maiken Nedergaard, who studies sleep at the University of Rochester. “But that’s wrong,” she says. While you sleep, your brain is working. For example, sleep helps prepare your brain to learn, remember, and create. Nedergaard and her colleagues discovered that the brain has a drainage system that removes toxins during sleep. “When we sleep, the brain totally changes function,” she explains. “It becomes almost like a kidney, removing waste from the system.” Her team found in mice that the drainage system removes some of the proteins linked with Alzheimer’s disease. These toxins were removed twice as fast from the brain during sleep. Everything from blood vessels to the immune system uses sleep as a time for repair, says Dr. Kenneth Wright, Jr., a sleep researcher at the University of Colorado. “There are certain repair processes that occur in the body mostly, or most effectively, during sleep,” he explains. “If you don’t get enough sleep, those processes are going to be disturbed.” How much sleep you need changes with age. Experts recommend school-age children get at least nine hours a night and teens get between eight and 10. Most adults need at least seven hours or more of sleep each night. There are many misunderstandings about sleep. One is that adults need less sleep as they get older. This isn’t true. Older adults still need the same amount. But sleep quality can get worse as you age. Older adults are also more likely to take medications that interfere with sleep. Another sleep myth is that you can “catch up” on your days off. Researchers are finding that this largely isn’t the case. “If you have one bad night’s sleep and take a nap, or sleep longer the next night, that can benefit you,” says Wright. “But if you have a week’s worth of getting too little sleep, the weekend isn’t sufficient for you to catch up. That’s not a healthy behavior.” In a recent study, Wright and his team looked at people with consistently deficient sleep. They compared them to sleep-deprived people who got to sleep in on the weekend. Both groups of people gained weight with lack of sleep. Their bodies’ ability to control blood sugar levels also got worse. The weekend catch-up sleep didn’t help. On the flip side, more sleep isn’t always better, says Brown. For adults, “if you’re sleeping more than nine hours a night and you still don’t feel refreshed, there may be some underlying medical issue,” she explains. Some people have conditions that prevent them from getting enough quality sleep, no matter how hard they try. These problems are called sleep disorders. The most common sleep disorder is insomnia. “Insomnia is when you have repeated difficulty getting to sleep and/or staying asleep,” says Brown. This happens despite having the time to sleep and a proper sleep environment. It can make you feel tired or unrested during the day. Insomnia can be short-term, where people struggle to sleep for a few weeks or months. “Quite a few more people have been experiencing this during the pandemic,” Brown says. Long-term insomnia lasts for three months or longer. Sleep apnea is another common sleep disorder. In sleep apnea, the upper airway becomes blocked during sleep. This reduces or stops airflow, which wakes people up during the night. The condition can be dangerous. If untreated, it may lead to other health problems. If you regularly have problems sleeping, talk with your health care provider. They may have you keep a sleep diary to track your sleep for several weeks. They can also run tests, including sleep studies. These look for sleep disorders. If you’re having trouble sleeping, hearing how important it is may be frustrating. But simple things can improve your odds of a good night’s sleep. See the Wise Choices box for tips to sleep better every day. Treatments are available for many common sleep disorders. Cognitive behavioral therapy can help many people with insomnia get better sleep. Medications can also help some people. Many people with sleep apnea benefit from using a device called a CPAP machine. These machines keep the airway open so that you can breathe. Other treatments can include special mouthguards and lifestyle changes. For everyone, “as best you can, try to make sleep a priority,” Brown says. “Sleep is not a throwaway thing—it’s a biological necessity.”",
    "tag": "sleep"
  },
  {
    "definition": "Good sleep is essential to good health. Yet for most of its history, sleep medicine has focused on the definition, identification, and treatment of sleep problems. Sleep health is a term that is infrequently used and even less frequently defined. It is time for us to change this. Indeed, pressures in the research, clinical, and regulatory environments require that we do so. The health of populations is increasingly defined by positive attributes such as wellness, performance, and adaptation, and not merely by the absence of disease. Sleep health can be defined in such terms. Empirical data demonstrate several dimensions of sleep that are related to health outcomes, and that can be measured with self-report and objective methods. One suggested definition of sleep health and a description of self-report items for measuring it are provided as examples. The concept of sleep health synergizes with other health care agendas, such as empowering individuals and communities, improving population health, and reducing health care costs. Promoting sleep health also offers the field of sleep medicine new research and clinical opportunities. In this sense, defining sleep health is vital not only to the health of populations and individuals, but also to the health of sleep medicine itself.",
    "tag": "sleep"
  },
  {
    "definition": "Sleep is an essential biological function with major roles in recovery, energy conservation, and survival (1). Sleep also appears to be important for vital functions such as neural development, learning, memory, emotional regulation, cardiovascular and metabolic function, and cellular toxin removal (2–5). It is clear that good-quality sleep is critical for good health and overall quality of life. Despite substantial interest from the general public, there are few health promotion recommendations on good sleep health to educate the general public and health care providers about the importance of sleep for overall health. In addition, there is a lack of formal sleep education globally for physicians and other health care providers.",
    "tag": "sleep"
  },
  {
    "definition": "Micronutrients play a central part in metabolism and in the maintenance of tissue function. An adequate intake therefore is necessary, but provision of excess supplements to people who do not need them may be harmful. Single micronutrient deficiency states are comparatively easily recognised and treated. Subclinical deficiency, often of multiple micronutrients, is more difficult to recognise, and laboratory assessment is often complicated by the acute phase response. Clinical benefit is most likely in those people who are severely depleted and at risk of complications, and is unlikely if this is not the case. There is little evidence for supplements leading to a reduction in the incidence of infections in the elderly population, in coronary artery disease, or in malignant disease. The best evidence for benefit is in critical illness, and in children in developing countries consuming a deficient diet. More clinical trials are required with good clinical outcomes to optimise intake in prevention and treatment of disease. There is growing interest in the role of the micronutrients (essential trace elements and vitamins) in optimising health, and in prevention or treatment of disease. This stems partly from the increase in knowledge and understanding of the biochemical functions of these nutrients, but also from the extensive but less well founded commercial claims for such substances. It is important that doctors and other health professionals are aware of the evidence for the nutritional essentiality of these substances, and for the situations where an increased intake may lead to clinical benefit. This review will therefore consider current knowledge of the requirements in health, those people at risk of an inadequate intake, and the conditions where supplements may be clinically required. The review will focus only on the generally accepted essential inorganic micronutrients (trace elements) and organic micronutrients (fat soluble and water soluble vitamins) for which deficiency states, with biochemical, physiological, or structural changes, have been clearly reported—such states occur after prolonged consumption of a diet lacking the single nutrient under consideration, and are uniquely corrected by addition of the nutrient back into the diet. Other nutrients for which there are no confirmed deficiency states, but where supplements are often taken, such as ω‐3 fatty acids, glucosamine, coenzyme Q, will not be considered.",
    "tag": "micronutrients"
  },
  {
    "definition": "Nearly 30 vitamins and minerals that your body cannot manufacture in sufficient amounts on its own are called essential micronutrients. British sailors learned centuries ago that living for months without fresh fruits or vegetables—the main sources of vitamin C—caused the bleeding gums and listlessness of scurvy, a disease that often proved fatal. Even today in many low-income countries, people frequently suffer from a variety of nutrient-deficiency diseases. True vitamin and mineral deficiencies—in which the lack of a single nutrient leads directly to a specific ailment—are rare in the United States because our extensive supply of inexpensive food, and the fortification of many common foods with some key nutrients. However, eating less than optimal amounts of important vitamins, minerals, and other compounds can still contribute to a number of major illnesses, such as heart disease, type 2 diabetes, cancer, and osteoporosis. Hence, concern about insufficiency — a controversial topic—is a major driver of both the U.S. dietary guidelines and the mass marketing of over-the-counter supplements.",
    "tag": "micronutrients"
  }
]